ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/scb/cy_scb_i2c.c
    base->INTR_SPI_EC_MASK = 0UL;
    base->INTR_I2C_EC_MASK = 0UL;
    base->INTR_RX_MASK     = 0UL;
    base->INTR_TX_MASK     = 0UL;
    base->INTR_M_MASK      = 0UL;
    base->INTR_S_MASK      = 0UL;
}


/*******************************************************************************
* Function Name: Cy_SCB_I2C_Disable
****************************************************************************//**
*
* Disables the SCB block and clears context statuses.
* Note that after the block is disabled, the TX and RX FIFOs and hardware
* statuses are cleared. Also, the hardware stops driving the output and
* ignores the input.
*
* \param base
* The pointer to the I2C SCB instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_scb_i2c_context_t allocated
* by the user. The structure is used during the I2C operation for internal
* configuration and data keeping. The user should not modify anything
* in this structure.
*
* \note
* Calling this function when I2C is busy (master preforms transaction or slave
* was address and communicates with master) may cause transaction corruption
* because the hardware stops driving the output and ignores the input.
* It is recommenced to ensure that I2C is not busy before calling this function.
*
*******************************************************************************/
void Cy_SCB_I2C_Disable(CySCB_Type *base, cy_stc_scb_i2c_context_t *context)
{
    base->CTRL &= (uint32_t) ~SCB_CTRL_ENABLED_Msk;

    /* Set the state to default and clear statuses */
    context->state        = CY_SCB_I2C_IDLE;
    context->masterStatus = 0UL;
    context->slaveStatus  = 0UL;
}


/*******************************************************************************
* Function Name: Cy_SCB_I2C_DeepSleep
****************************************************************************//**
*
* Configures the I2C slave to be a wake-up source from Deep Sleep on address
* match: configures the wake-up behavior and enables wake-up interrupt.
* Note that a wake-up from the Deep Sleep option must be enabled during
* initialization. If this was not done, this function does nothing.
*
* \param base
* The pointer to the I2C SCB instance.
*
* \param wakeupAction
* Determines the slaves behavior after a wake-up: NAKs address (master has to
* retry) or stretches the clock and continues the transaction when the device
* is awaken.
* See \ref group_scb_i2c_macro_wake_up for the set of constants.
*
* \note
* Not all SCB blocks are capable to be a wake-up source from Deep Sleep.
* Consult the device datasheet to determine which SCB supports this option.
*
*******************************************************************************/
void Cy_SCB_I2C_DeepSleep(CySCB_Type *base, uint32_t wakeupAction)
{
    if (_FLD2BOOL(SCB_CTRL_EC_AM_MODE, base->CTRL))
    {
        if (CY_SCB_I2C_WAKEUP_NACK == wakeupAction)
        {
            base->I2C_CTRL |= (uint32_t) SCB_I2C_CTRL_S_NOT_READY_ADDR_NACK_Msk;
        }
        else
        {
            base->I2C_CTRL &= (uint32_t) ~SCB_I2C_CTRL_S_NOT_READY_ADDR_NACK_Msk;
        }

        Cy_SCB_SetI2CInterruptMask(base, CY_SCB_I2C_INTR_WAKEUP);
    }
}


/*******************************************************************************
* Function Name: Cy_SCB_I2C_Wakeup
****************************************************************************//**
*
* Disables the wake-up interrupt.
*
* \param base
* The pointer to the I2C SCB instance.
*
*******************************************************************************/
void Cy_SCB_I2C_Wakeup(CySCB_Type *base)
{
    if (_FLD2BOOL(SCB_CTRL_EC_AM_MODE, base->CTRL))
    {
        Cy_SCB_SetI2CInterruptMask(base, CY_SCB_CLEAR_ALL_INTR_SRC);
    }
}


/*******************************************************************************
* Function Name: Cy_SCB_I2C_SetDataRate
****************************************************************************//**
*
* Configures the SCB to work at the desired data rate.
*
* \param base
* The pointer to the I2C SCB instance.
*
* \param dataRateHz
* The desired data Rate in Hz.
*
* \param scbClockkHz
* The frequency of the clock connected to the SCB in kHz.
*
* \return
* The achieved data rate in Hz.
*
* \note
* This function does not change the values of the clock divider connected
* to the SCB, it only changes the SCB clock oversample registers. If this
* function is not able to achieve the desired data rate, then the clock
* divider has to be adjusted. Call this function only while the SCB is
* disabled. For the slave, this function only checks that the attached clock is
* fast enough to meet the desired data rate, it does not change any registers.
*
*******************************************************************************/
uint32_t Cy_SCB_I2C_SetDataRate(CySCB_Type *base, uint32_t dataRateHz, uint32_t scbClockkHz)
{
    uint32_t actDataRate = 1UL;

    if (CY_SCB_I2C_SLAVE == _FLD2VAL(CY_SCB_I2C_CTRL_MODE, base->I2C_CTRL))
    {
        actDataRate = Cy_SCB_I2C_GetDataRate(base, scbClockkHz);

        /* Use an analog filter */
        base->RX_CTRL &= (uint32_t) SCB_RX_CTRL_MEDIAN_Msk;
        base->I2C_CFG  = CY_SCB_I2C_ENABLE_ANALOG_FITLER;
    }
    else
    {
        uint32_t idx = 0UL;
        uint32_t dutyCycleLow;
        uint32_t dutyCycleHigh;

        uint32_t fstpClockMin = (CY_SCB_I2C_MASTER == _FLD2VAL(CY_SCB_I2C_CTRL_MODE, base->I2C_CTRL)) ?
                                    CY_SCB_I2C_MASTER_FSTP_MIN : CY_SCB_I2C_SLAVE_FSTP_CLK_MIN;

        /* Check the clock to be in the range and set the minimum duty cycle */
        if ((scbClockkHz >= CY_SCB_I2C_MASTER_STD_CLK_MIN) && (scbClockkHz <= CY_SCB_I2C_MASTER_STD_CLK_MAX))
        {
            dutyCycleLow  = CY_SCB_I2C_MASTER_STD_LOW_MIN;
            dutyCycleHigh = CY_SCB_I2C_MASTER_STD_HIGH_MIN;
        }
        else if ((scbClockkHz >= CY_SCB_I2C_MASTER_FST_MIN) && (scbClockkHz <= CY_SCB_I2C_MASTER_FST_MIN))
        {
            dutyCycleLow  = CY_SCB_I2C_MASTER_FST_LOW_MIN;
            dutyCycleHigh = CY_SCB_I2C_MASTER_FST_HIGH_MIN;
        }
        else if ((scbClockkHz >= fstpClockMin) && (scbClockkHz <= CY_SCB_I2C_MASTER_FSTP_MAX))
        {
            dutyCycleLow  = CY_SCB_I2C_MASTER_FSTP_LOW_MIN;
            dutyCycleHigh = CY_SCB_I2C_MASTER_FSTP_HIGH_MIN;
        }
        else
        {
            /* The clock frequency is too low or it gets to the gap between
            * the Fast and Fast Plus data rates
            */
            actDataRate = 0UL;
        }

        if (actDataRate > 0UL)
        {
            /* Adjust the duty cycle low and high to reach the requested data rate */
            do
            {
                /* Calculate the actual data rate */
                actDataRate = (1000U * scbClockkHz) / (dutyCycleLow + dutyCycleHigh);

                if (actDataRate > dataRateHz)
                {
                    /* Increment the duty cycle low or high */
                    if (0UL == (idx & 0x1U))
                    {
                        if (dutyCycleLow < CY_SCB_I2C_PHASE_DUTY_CYCLE_MAX)
                        {
                            ++dutyCycleLow;
                        }
                    }
                    else
                    {
                        if (dutyCycleHigh < CY_SCB_I2C_PHASE_DUTY_CYCLE_MAX)
                        {
                            ++dutyCycleHigh;
                        }

                        if (dutyCycleLow == CY_SCB_I2C_PHASE_DUTY_CYCLE_MAX)
                        {
                            ++idx;
                        }
                    }

