ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/scb/cy_scb_i2c.c
                    ++idx;
                }
                else
                {
                    break;
                }
            }
            while ((dutyCycleLow + dutyCycleHigh) < CY_SCB_I2C_DUTY_CYCLE_MAX);

            /* Configure the duty cycle low and high */
            Cy_SCB_I2C_MasterSetLowPhaseDutyCycle (base, dutyCycleLow);
            Cy_SCB_I2C_MasterSetHighPhaseDutyCycle(base, dutyCycleHigh);

            /* Update the actual data rate for the case when the low and high duty cycle are max values */
            actDataRate = (1000U * scbClockkHz) / (dutyCycleLow + dutyCycleHigh);

            /* Update the filter settings */
            if (actDataRate > CY_SCB_I2C_SLAVE_FST_DATA_RATE)
            {
                /* Use a digital filter */
                base->RX_CTRL |= (uint32_t) SCB_RX_CTRL_MEDIAN_Msk;
                base->I2C_CFG  = CY_SCB_I2C_DISABLE_ANALOG_FITLER;
            }
            else
            {
                /* Use an analog filter */
                base->RX_CTRL &= (uint32_t) SCB_RX_CTRL_MEDIAN_Msk;
                base->I2C_CFG  = CY_SCB_I2C_ENABLE_ANALOG_FITLER;
            }
        }
    }

    return (actDataRate);
}


/*******************************************************************************
* Function Name: Cy_SCB_I2C_GetDataRate
****************************************************************************//**
*
* Returns the data rate for the selected SCB block.
*
* \param base
* The pointer to the I2C SCB instance.
*
* \param scbClockkHz
* The frequency of the clock connected to the SCB in kHz.
*
* \return
* The data rate in Hz.
*
*******************************************************************************/
uint32_t Cy_SCB_I2C_GetDataRate(CySCB_Type const *base, uint32_t scbClockkHz)
{
    uint32_t actDataRate;

    if (_FLD2VAL(CY_SCB_I2C_CTRL_MODE, base->I2C_CTRL) == CY_SCB_I2C_SLAVE)
    {
        /* Check the clock frequency range to get maximum supported data rate */
        if ((scbClockkHz >= CY_SCB_I2C_SLAVE_FST_CLK_MIN) && (scbClockkHz <= CY_SCB_I2C_SLAVE_FST_CLK_MAX))
        {
            actDataRate = CY_SCB_I2C_SLAVE_FST_DATA_RATE;
        }
        else if ((scbClockkHz >= CY_SCB_I2C_SLAVE_STD_CLK_MIN) && (scbClockkHz <= CY_SCB_I2C_SLAVE_STD_CLK_MAX))
        {
            actDataRate = CY_SCB_I2C_SLAVE_STD_DATA_RATE;
        }
        else if ((scbClockkHz >= CY_SCB_I2C_SLAVE_FSTP_CLK_MIN) && (scbClockkHz <= CY_SCB_I2C_SLAVE_FSTP_CLK_MAX))
        {
            actDataRate = CY_SCB_I2C_SLAVE_FST_DATA_RATE;
        }
        else
        {
            /* The clock frequency is too low or it gets to the gap between
            * Fast and Fast Plus data rates.
            */
            actDataRate = 0UL;
        }
    }
    else
    {
        uint32_t dutyCycle;

        dutyCycle  = (_FLD2VAL(SCB_I2C_CTRL_LOW_PHASE_OVS, base->I2C_CTRL) + 1U);
        dutyCycle += (_FLD2VAL(SCB_I2C_CTRL_HIGH_PHASE_OVS, base->I2C_CTRL) + 1U);

        /* Calculate the actual data rate */
        actDataRate = (1000UL * scbClockkHz) / dutyCycle;
    }

    return (actDataRate);
}


/*******************************************************************************
*                         I2C Slave API
*******************************************************************************/

/*******************************************************************************
* Function Name: Cy_SCB_I2C_SlaveGetStatus
****************************************************************************//**
*
* Returns the current I2C slave status.
* This status is a bit mask and the value returned may have multiple bits set.
*
* \param base
* The pointer to the I2C SCB instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_scb_i2c_context_t allocated
* by the user. The structure is used during the I2C operation for internal
* configuration and data keeping. The user should not modify anything
* in this structure.
*
* \return
* \ref group_scb_i2c_macro_slave_status.
*
*******************************************************************************/
uint32_t Cy_SCB_I2C_SlaveGetStatus(CySCB_Type const *base, cy_stc_scb_i2c_context_t const *context)
{
    /* Suppress a compiler warning about unused variables */
    (void) base;

    return (context->slaveStatus);
}


/*******************************************************************************
* Function Name: Cy_SCB_I2C_SlaveConfigReadBuf
****************************************************************************//**
*
* Configures the buffer pointer and the read buffer size. This is the buffer
* that the master reads data from. After this function is called, data
* transfer from the read buffer to the master is handled by
* \ref Cy_SCB_I2C_Interrupt.
*
* When Read transaction is completed (master generated Stop, ReStart or
* error occurred), the \ref CY_SCB_I2C_SLAVE_RD_BUSY status is cleared and
* the \ref CY_SCB_I2C_SLAVE_RD_CMPLT is set, also
* the \ref CY_SCB_I2C_SLAVE_RD_CMPLT_EVENT event is generated.
*
* \param base
* The pointer to the I2C SCB instance.
*
* \param rdBuf
* The pointer to the buffer with data to be read by the master.
*
* \param size
* An amount of data the master can read from rdBuf.
*
* \param context
* The pointer to the context structure \ref cy_stc_scb_i2c_context_t allocated
* by the user. The structure is used during the I2C operation for internal
* configuration and data keeping. The user should not modify anything
* in this structure.
*
* \note
* * The Read buffer must not be modified and stay allocated until it has been
*   read by the master.
* * If this function has not been called, and the master tries to read data
*   from the slave a \ref CY_SCB_I2C_DEFAULT_TX is returned to the master.
* * If the master tries to read more bytes than available in the Read buffer,
*   a \ref CY_SCB_I2C_SLAVE_RD_BUF_EMPTY_EVENT event occurs. The
*   \ref CY_SCB_I2C_DEFAULT_TX is returned to the master if the buffer remains
*   empty after an event notification.
*
*******************************************************************************/
void Cy_SCB_I2C_SlaveConfigReadBuf(CySCB_Type const *base, uint8_t *rdBuf, uint32_t size,
                                cy_stc_scb_i2c_context_t *context)
{
    /* Suppress a compiler warning about unused variables */
    (void) base;

    if (NULL != rdBuf)
    {
        context->slaveTxBuffer     = rdBuf;
        context->slaveTxBufferSize = size;
        context->slaveTxBufferIdx  = 0UL;
        context->slaveTxBufferCnt  = 0UL;
    }
}


